#version: 0.2
a r
v ar
var _
s e
e r
h a
d o
k _
e i
se p
sep _
sep_ do
sep_do t</w>
r a
o p
o t
q u
qu ot
b ra
quot _
quot_ m
quot_m ar
ha s
: has
c k_
bra ck_
a se
C T</w>
B ase
- Base
t i
i n
g l
gl ei
glei f
e n</w>
var_ s</w>
var_ e</w>
o s
a t
var_ a</w>
e n
e s</w>
in g
e k
n .
op a
opa -Base
opa-Base :has
ei opa-Base:has
