#version: 0.2
a r
e r
v ar
var _
s e
k _
h a
o p
r a
i n
d o
e i
se p
sep _
sep_ do
sep_do t</w>
b ra
in g
ha s
: has
q u
o t
qu ot
quot _
quot_ m
quot_m ar
quot_mar k_
c k_
bra ck_
a se
C T</w>
B ase
- Base
a t
op a
opa -Base
opa-Base :has
ei opa-Base:has
e n</w>
n t
var_ e</w>
o s
var_ o</w>
e k
nt i
n .
eiopa-Base:has I
d e
a m
v er
