{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "from os import listdir\n",
    "from os.path import join, isfile\n",
    "from rdflib import URIRef, term, Graph, Literal, Namespace\n",
    "from rdflib.namespace import OWL,RDF, RDFS, SKOS, XSD\n",
    "# from src_eiopa.features.generator_utils import encode,add_quotation_marks,strip_brackets\n",
    "# from sacremoses import MosesTokenizer,MosesDetokenizer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "EIOPA_DATA_PATH = join(\"..\", \"data\", \"eiopa\", \"1_external\", \"eiopa\")\n",
    "GLEIF_DATA_PATH = join(\"..\", \"data\", \"eiopa\", \"1_external\", \"gleif\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Read EIOPA Register in RDF"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "graph has 375390 statements.\n"
     ]
    }
   ],
   "source": [
    "g = Graph()\n",
    "\n",
    "with open(join(EIOPA_DATA_PATH,'eiopa_register.ttl'), \"rb\") as fp:\n",
    "    g.parse(data = fp.read(), format = 'turtle')\n",
    "\n",
    "with open(join(GLEIF_DATA_PATH,'gleif-L1-extract.ttl'), \"rb\") as fp:\n",
    "    g.parse(data = fp.read(), format = 'turtle')\n",
    "    \n",
    "with open(join(GLEIF_DATA_PATH,'EntityLegalFormData.ttl'), \"rb\") as fp:\n",
    "    g.parse(data = fp.read(), format = 'turtle')\n",
    "\n",
    "print(\"graph has {} statements.\".format(len(g)))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Example SPARQL queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "# function to visualize the name of the uri without namespace\n",
    "def get_name(uri):\n",
    "    if isinstance(uri, term.URIRef):\n",
    "        return uri.n3().split(\"/\")[-1][0:-1]\n",
    "    else:\n",
    "        return uri"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "NL\n",
      "KMU Verzekeringen N.V.\n",
      "VIVAT Schadeverzekeringen N.V.\n",
      "Onderlinge Steenwijker Brandassurantie Vereniging U.A.\n",
      "Leidsche Verzekering Maatschappij N.V.\n",
      "Brand New Day Levensverzekeringen N.V.\n",
      "ABN AMRO Schadeverzekering N.V.\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Aanvullende Verzekering Zorgverzekeraar u.a.\n",
      "NN Non-Life Insurance N.V.\n",
      "Onderlinge Verzekerings Maatschappij \"De Onderlingen\" U.A.\n",
      "N.V. Zorgverzekeraar UMC\n",
      "Woningborg N.V.\n",
      "AEGON Levensverzekering N.V.\n",
      "N.V. Univé Zorg\n",
      "N.V. Schadeverzekeringsmaatschappij Maas Lloyd\n",
      "Achmea Pensioen- en Levensverzekeringen N.V.\n",
      "N.V. Levensverzekering-Maatschappij \"De Hoop\"\n",
      "OVM Onderlinge Verzekeringen U.A.\n",
      "Monuta Verzekeringen N.V.\n",
      "Interpolis Zorgverzekeringen N.V.\n",
      "Centrale Ziektekostenverzekering NZV N.V.\n",
      "N.V. Univé Schade\n",
      "N.V. Schadeverzekering Metaal en Technische Bedrijfstakken\n",
      "ONVZ Aanvullende Verzekering N.V.\n",
      "Actua Schadeverzekering N.V.\n",
      "VvAA Levensverzekeringen N.V.\n",
      "BNP PARIBAS CARDIF SCHADEVERZEKERINGEN N.V.\n",
      "N.V. Verzekeringsbedrijf Groot Amsterdam (VGA)\n",
      "Univé Zuid-Nederland Verzekeringen N.V.\n",
      "National Academic Verzekeringsmaatschappij N.V.\n",
      "Menzis Zorgverzekeraar N.V.\n",
      "Yarden Uitvaartverzekeringen N.V.\n",
      "Mercurius Schadeverzekeringen N.V.\n",
      "Menzis N.V.\n",
      "Bos Fruit Aardappelen Onderlinge verzekeringen BFAO U.A.\n",
      "Unilever Insurances N.V.\n",
      "N.V. Noordhollandsche van 1816, Levensverzekeringsmaatschappij\n",
      "Onderlinge Verzekeringsmaatschappij De Veenhoop u.a.\n",
      "TVM verzekeringen N.V.\n",
      "N.V. Verzekering Maatschappij \"De Burcht\"\n",
      "Robein Leven N.V.\n",
      "Nationale-Nederlanden Levensverzekering Maatschappij N.V.\n",
      "E.O.C. Onderlinge Schepenverzekering U.A.\n",
      "UK P&I Club N.V.\n",
      "OOM Global Care N.V.\n",
      "AEGON Schadeverzekering N.V.\n",
      "Univé Het Groene Hart Brandverzekeraar N.V.\n",
      "SRLEV N.V.\n",
      "Stichtsche Onderlinge Brand-Herverzekering U.A.\n",
      "ASSURANT EUROPE INSURANCE N.V.\n",
      "Enel Insurance N.V.\n",
      "N.V. Schadeverzekering-Maatschappij Bovemij\n",
      "ASR Schadeverzekering N.V.\n",
      "Onderlinge Verzekeringsmaatschappij \"Waterland en Omstreken U.A.\"\n",
      "de Vereende N.V.\n",
      "Univé Noord-Holland Brandverzekeraar N.V.\n",
      "Onderlinge Verzekerings-Maatschappij \"Noord Nederlandsche P&I Club\" U.A.\n",
      "Algemene Friese Onderlinge Schadeverzekeringsmaatschappij \"Zevenwouden\" U.A.\n",
      "Onderlinge Verzekering Maatschappij Donatus U.A.\n",
      "Onderlinge Waarborg Maatschappij Achterhoek U.A.\n",
      "N.V. Noordhollandsche van 1816, Schadeverzekeringsmaatschappij\n",
      "UVM Verzekeringsmaatschappij N.V.\n",
      "Goudse Levensverzekeringen N.V.\n",
      "Onderlinge Waarborgmaatschappij Centramed B.A.\n",
      "Onderlinge Verzekeringsmaatschappij Univé Samen U.A.\n",
      "NS Insurance N.V.\n",
      "FBTO Zorgverzekeringen N.V.\n",
      "OOM Schadeverzekering N.V.\n",
      "Waard Schade N.V.\n",
      "Eno Aanvullende Verzekeringen N.V.\n",
      "Zilveren Kruis Zorgverzekeringen N.V.\n",
      "OHRA Ziektekostenverzekeringen N.V.\n",
      "CZ Zorgverzekeringen N.V.\n",
      "NN Re (Netherlands) N.V.\n",
      "Roeminck Insurance N.V.\n",
      "ABN AMRO Captive N.V.\n",
      "Univé Oost Brandverzekeraar N.V.\n",
      "Onderlinge Verzekering Maatschappij ZLM U.A.\n",
      "Eno Zorgverzekeraar N.V.\n",
      "Onderling Fonds \"Sliedrecht\" B.A.\n",
      "Onderlinge Verzekerings Maatschappij Rijn en Aar U.A.\n",
      "Onderlinge Waarborgmaatschappij DSW Zorgverzekeraar U.A.\n",
      "Rabo Herverzekeringsmaatschappij N.V.\n",
      "DSW Ziektekostenverzekeringen N.V.\n",
      "N.V. Hagelunie\n",
      "ASSURANT EUROPE LIFE INSURANCE N.V.\n",
      "Glasassurantie Maatschappij Midglas N.V.\n",
      "Onderlinge Hagelverzekering Maatschappij Agriver B.A.\n",
      "ASR Basis Ziektekostenverzekeringen N.V.\n",
      "Waard Leven N.V.\n",
      "Eerste Friesche Onderlinge Paarden Verzekeringsmaatschappij U.A.\n",
      "Nationale-Nederlanden Schadeverzekering Maatschappij N.V.\n",
      "DELA Natura- en levensverzekeringen N.V.\n",
      "Onderlinge Waarborgmaatschappij voor Instellingen in de Gezondheidszorg MediRisk B.A.\n",
      "Reis- en Rechtshulp N.V.\n",
      "Onderlinge Verzekering Maatschappij Twente U.A.\n",
      "AEGON Spaarkas N.V.\n",
      "ASR Aanvullende Ziektekostenverzekeringen N.V.\n",
      "Lifetri Uitvaartverzekeringen N.V.\n",
      "Lemonade Insurance N.V.\n",
      "Onderlinge Verzekeringmaatschappij \"SOM\" U.A.\n",
      "Samenwerking Glasverzekering N.V.\n",
      "Klaverblad Schadeverzekeringsmaatschappij N.V.\n",
      "N.V. Univé Her\n",
      "Mutual Insurance Association \"Munis\" (Onderlinge Verzekeringsmaatschappij \"Munis\") U.A.\n",
      "IZA Zorgverzekeraar N.V.\n",
      "DAS Nederlandse Rechtsbijstand Verzekeringmaatschappij N.V.\n",
      "Univé Stad en Land Brandverzekeraar N.V.\n",
      "ONVZ Ziektekostenverzekeraar N.V.\n",
      "DLE Natura Uitvaartverzekeringen N.V.\n",
      "Proteq Levensverzekeringen N.V.\n",
      "VGZ Zorgverzekeraar N.V.\n",
      "Univé Noord-Nederland Verzekeraar N.V.\n",
      "Blue Square Re N.V.\n",
      "SCILDON N.V.\n",
      "Achmea Zorgverzekeringen N.V.\n",
      "Onderlinge Levensverzekering-Maatschappij \"'s-Gravenhage\" U.A.\n",
      "Achmea Reinsurance Company N.V.\n",
      "Onderlinge Waarborgmaatschappij Sazas U.A.\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Zorgverzekeraar U.A.\n",
      "AnderZorg N.V.\n",
      "Goudse Schadeverzekeringen N.V.\n",
      "Ansvar Verzekeringsmaatschappij N.V.\n",
      "BNP PARIBAS CARDIF LEVENSVERZEKERINGEN N.V.\n",
      "Onderling Verzekerd U.A.\n",
      "ABN AMRO Levensverzekering N.V.\n",
      "Lifetri Verzekeringen N.V.\n",
      "ASR Levensverzekering N.V.\n",
      "De Friesland Zorgverzekeraar N.V.\n",
      "Achmea Schadeverzekeringen N.V.\n",
      "Uitvaartverzekering Twenthe N.V.\n",
      "VvAA schadeverzekeringen N.V.\n",
      "Univé Dichtbij Brandverzekeraar N.V.\n",
      "Stad Holland Zorgverzekeraar Onderlinge Waarborgmaatschappij U.A.\n",
      "Onderlinge Brandwaarborg Maatschappij Noord Holland U.A.\n",
      "AKZO Nobel Assurantie N.V.\n",
      "Anker Insurance Company N.V.\n",
      "Klaverblad Levensverzekering N.V.\n",
      "Onderlinge Waarborgmaatschappij Zorgverzekeraar Zorg en Zekerheid U.A.\n"
     ]
    }
   ],
   "source": [
    "# if A is a legal name\n",
    "\n",
    "# In what jurisdiction does <A> operate?\n",
    "# In what country does <A> operate?\n",
    "# What is <A>'s jurisdiction?\n",
    "# What is the jurisdiction of <A>?\n",
    "# Where does <A> operate?\n",
    "# Jurisdiction of <A>?\n",
    "\n",
    "query = \"\"\"SELECT DISTINCT ?o\n",
    "           WHERE {?e eiopa-Base:hasIdentifyingName \"achmea zorgverzekeringen n.v.\". \n",
    "                  ?e eiopa-Base:hasEUCountryWhereEntityOperates ?o .\n",
    "}\"\"\"\n",
    "\n",
    "# SELECT DISTINCT ?o WHERE {?e eiopa-Base:hasIdentifyingName <A>. ?e eiopa-Base:hasEUCountryWhereEntityOperates ?o.}\n",
    "results = g.query(query)\n",
    "\n",
    "for row in results:\n",
    "    print(get_name(row[0]))\n",
    "    \n",
    "generator_query = \"\"\" select distinct ?a where{\n",
    "                  ?s gleif-L1:hasLegalName ?a . \n",
    "                  ?e gleif-Base:identifies ?s .\n",
    "                  ?e eiopa-Base:hasEUCountryWhereEntityOperates CountryCodes:NL.\n",
    "}\"\"\"\n",
    "\n",
    "results = g.query(generator_query)\n",
    "for row in results:\n",
    "    print(get_name(row[0]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "NL\n",
      "W1972\n",
      "W0083\n",
      "W0186\n",
      "L0151\n",
      "L0182\n",
      "W1219\n",
      "W1423\n",
      "W1680\n",
      "W0192\n",
      "W1909\n",
      "W1940\n",
      "L0077\n",
      "W1877\n",
      "W0319\n",
      "L0180\n",
      "H0088\n",
      "W0355\n",
      "L0104\n",
      "W1911\n",
      "W1619\n",
      "W1875\n",
      "W1727\n",
      "W1886\n",
      "W1702\n",
      "L0093\n",
      "W1840\n",
      "W0064\n",
      "W1969\n",
      "W1910\n",
      "W1978\n",
      "N0015\n",
      "W0060\n",
      "W1977\n",
      "W1104\n",
      "W0143\n",
      "L0215\n",
      "W0302\n",
      "W1986\n",
      "W1642\n",
      "L0116\n",
      "L0046\n",
      "W0219\n",
      "R161589\n",
      "W1743\n",
      "W0065\n",
      "W1976\n",
      "L0216\n",
      "H0089\n",
      "R161237\n",
      "W1988\n",
      "W0145\n",
      "W0132\n",
      "W1711\n",
      "W1031\n",
      "W1938\n",
      "W0389\n",
      "W0174\n",
      "W0164\n",
      "W0393\n",
      "W0087\n",
      "W1650\n",
      "L0017\n",
      "W1752\n",
      "W0281\n",
      "W1805\n",
      "W1913\n",
      "W1749\n",
      "W1767\n",
      "W1943\n",
      "W1817\n",
      "W1710\n",
      "W1889\n",
      "H0073\n",
      "W1958\n",
      "H0132\n",
      "W1961\n",
      "W0128\n",
      "W1942\n",
      "L0025\n",
      "W0344\n",
      "W1899\n",
      "H0125\n",
      "W1576\n",
      "W1487\n",
      "R161238\n",
      "W1258\n",
      "W0449\n",
      "W1921\n",
      "L0155\n",
      "W1292\n",
      "W0123\n",
      "L0171\n",
      "W1706\n",
      "W1589\n",
      "W1090\n",
      "L0008\n",
      "W1922\n",
      "R140252\n",
      "R162036\n",
      "W1806\n",
      "W1974\n",
      "W0109\n",
      "H0134\n",
      "W1497\n",
      "W1908\n",
      "W1027\n",
      "W1954\n",
      "W1788\n",
      "N0042\n",
      "L0131\n",
      "W1920\n",
      "W1963\n",
      "H0133\n",
      "L0119\n",
      "W1825\n",
      "L0029\n",
      "H0074\n",
      "W1789\n",
      "W1906\n",
      "W1981\n",
      "W0035\n",
      "W0147\n",
      "L0187\n",
      "W1868\n",
      "L0150\n",
      "R140256\n",
      "L0058\n",
      "W1983\n",
      "W1686\n",
      "N0048\n",
      "W0010\n",
      "W1973\n",
      "W1902\n",
      "W0301\n",
      "W1709\n",
      "W1860\n",
      "L0129\n",
      "W1904\n"
     ]
    }
   ],
   "source": [
    "# if A is an insurance ID\n",
    "\n",
    "# In what jurisdiction does A operate?\n",
    "# In what country does A operate?\n",
    "# What is <A>'s jurisdiction?\n",
    "# What is the jurisdiction of <A>?\n",
    "# Where does <A> operate?\n",
    "# Jurisdiction of <A>?\n",
    "\n",
    "query = \"\"\"SELECT DISTINCT ?o\n",
    "           WHERE {?e eiopa-Base:hasEUCountryWhereEntityOperates ?o .\n",
    "                  ?e eiopa-Base:hasInsuranceUndertakingID \"W1686\".\n",
    "}\"\"\"\n",
    "results = g.query(query)\n",
    "\n",
    "for row in results:\n",
    "    print(get_name(row[0]))\n",
    "\n",
    "generator_query = \"\"\" select distinct ?a where{\n",
    "                  ?e eiopa-Base:hasEUCountryWhereEntityOperates CountryCodes:NL .\n",
    "                  ?e eiopa-Base:hasInsuranceUndertakingID ?a.\n",
    "}\"\"\"\n",
    "\n",
    "results = g.query(generator_query)\n",
    "for row in results:\n",
    "    print(get_name(row[0]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "De Nederlandsche Bank\n",
      "KMU Verzekeringen N.V.\n",
      "VIVAT Schadeverzekeringen N.V.\n",
      "Onderlinge Steenwijker Brandassurantie Vereniging U.A.\n",
      "Leidsche Verzekering Maatschappij N.V.\n",
      "Brand New Day Levensverzekeringen N.V.\n",
      "ABN AMRO Schadeverzekering N.V.\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Aanvullende Verzekering Zorgverzekeraar u.a.\n",
      "NN Non-Life Insurance N.V.\n",
      "Onderlinge Verzekerings Maatschappij \"De Onderlingen\" U.A.\n",
      "N.V. Zorgverzekeraar UMC\n",
      "Woningborg N.V.\n",
      "AEGON Levensverzekering N.V.\n",
      "N.V. Univé Zorg\n",
      "N.V. Schadeverzekeringsmaatschappij Maas Lloyd\n",
      "Achmea Pensioen- en Levensverzekeringen N.V.\n",
      "N.V. Levensverzekering-Maatschappij \"De Hoop\"\n",
      "OVM Onderlinge Verzekeringen U.A.\n",
      "Monuta Verzekeringen N.V.\n",
      "Interpolis Zorgverzekeringen N.V.\n",
      "Centrale Ziektekostenverzekering NZV N.V.\n",
      "N.V. Univé Schade\n",
      "N.V. Schadeverzekering Metaal en Technische Bedrijfstakken\n",
      "ONVZ Aanvullende Verzekering N.V.\n",
      "Actua Schadeverzekering N.V.\n",
      "VvAA Levensverzekeringen N.V.\n",
      "BNP PARIBAS CARDIF SCHADEVERZEKERINGEN N.V.\n",
      "N.V. Verzekeringsbedrijf Groot Amsterdam (VGA)\n",
      "Univé Zuid-Nederland Verzekeringen N.V.\n",
      "National Academic Verzekeringsmaatschappij N.V.\n",
      "Menzis Zorgverzekeraar N.V.\n",
      "Yarden Uitvaartverzekeringen N.V.\n",
      "Mercurius Schadeverzekeringen N.V.\n",
      "Menzis N.V.\n",
      "Bos Fruit Aardappelen Onderlinge verzekeringen BFAO U.A.\n",
      "Unilever Insurances N.V.\n",
      "N.V. Noordhollandsche van 1816, Levensverzekeringsmaatschappij\n",
      "Onderlinge Verzekeringsmaatschappij De Veenhoop u.a.\n",
      "TVM verzekeringen N.V.\n",
      "N.V. Verzekering Maatschappij \"De Burcht\"\n",
      "Robein Leven N.V.\n",
      "Nationale-Nederlanden Levensverzekering Maatschappij N.V.\n",
      "E.O.C. Onderlinge Schepenverzekering U.A.\n",
      "UK P&I Club N.V.\n",
      "OOM Global Care N.V.\n",
      "AEGON Schadeverzekering N.V.\n",
      "Univé Het Groene Hart Brandverzekeraar N.V.\n",
      "SRLEV N.V.\n",
      "Stichtsche Onderlinge Brand-Herverzekering U.A.\n",
      "ASSURANT EUROPE INSURANCE N.V.\n",
      "Enel Insurance N.V.\n",
      "N.V. Schadeverzekering-Maatschappij Bovemij\n",
      "ASR Schadeverzekering N.V.\n",
      "Onderlinge Verzekeringsmaatschappij \"Waterland en Omstreken U.A.\"\n",
      "de Vereende N.V.\n",
      "Univé Noord-Holland Brandverzekeraar N.V.\n",
      "Onderlinge Verzekerings-Maatschappij \"Noord Nederlandsche P&I Club\" U.A.\n",
      "Algemene Friese Onderlinge Schadeverzekeringsmaatschappij \"Zevenwouden\" U.A.\n",
      "Onderlinge Verzekering Maatschappij Donatus U.A.\n",
      "Onderlinge Waarborg Maatschappij Achterhoek U.A.\n",
      "N.V. Noordhollandsche van 1816, Schadeverzekeringsmaatschappij\n",
      "UVM Verzekeringsmaatschappij N.V.\n",
      "Goudse Levensverzekeringen N.V.\n",
      "Onderlinge Waarborgmaatschappij Centramed B.A.\n",
      "Onderlinge Verzekeringsmaatschappij Univé Samen U.A.\n",
      "NS Insurance N.V.\n",
      "FBTO Zorgverzekeringen N.V.\n",
      "OOM Schadeverzekering N.V.\n",
      "Waard Schade N.V.\n",
      "Eno Aanvullende Verzekeringen N.V.\n",
      "Zilveren Kruis Zorgverzekeringen N.V.\n",
      "OHRA Ziektekostenverzekeringen N.V.\n",
      "CZ Zorgverzekeringen N.V.\n",
      "NN Re (Netherlands) N.V.\n",
      "Roeminck Insurance N.V.\n",
      "ABN AMRO Captive N.V.\n",
      "Univé Oost Brandverzekeraar N.V.\n",
      "Onderlinge Verzekering Maatschappij ZLM U.A.\n",
      "Eno Zorgverzekeraar N.V.\n",
      "Onderling Fonds \"Sliedrecht\" B.A.\n",
      "Onderlinge Verzekerings Maatschappij Rijn en Aar U.A.\n",
      "Onderlinge Waarborgmaatschappij DSW Zorgverzekeraar U.A.\n",
      "Rabo Herverzekeringsmaatschappij N.V.\n",
      "DSW Ziektekostenverzekeringen N.V.\n",
      "N.V. Hagelunie\n",
      "ASSURANT EUROPE LIFE INSURANCE N.V.\n",
      "Glasassurantie Maatschappij Midglas N.V.\n",
      "Onderlinge Hagelverzekering Maatschappij Agriver B.A.\n",
      "ASR Basis Ziektekostenverzekeringen N.V.\n",
      "Waard Leven N.V.\n",
      "Eerste Friesche Onderlinge Paarden Verzekeringsmaatschappij U.A.\n",
      "Nationale-Nederlanden Schadeverzekering Maatschappij N.V.\n",
      "DELA Natura- en levensverzekeringen N.V.\n",
      "Onderlinge Waarborgmaatschappij voor Instellingen in de Gezondheidszorg MediRisk B.A.\n",
      "Reis- en Rechtshulp N.V.\n",
      "Onderlinge Verzekering Maatschappij Twente U.A.\n",
      "AEGON Spaarkas N.V.\n",
      "ASR Aanvullende Ziektekostenverzekeringen N.V.\n",
      "Lifetri Uitvaartverzekeringen N.V.\n",
      "Lemonade Insurance N.V.\n",
      "Onderlinge Verzekeringmaatschappij \"SOM\" U.A.\n",
      "Samenwerking Glasverzekering N.V.\n",
      "Klaverblad Schadeverzekeringsmaatschappij N.V.\n",
      "N.V. Univé Her\n",
      "Mutual Insurance Association \"Munis\" (Onderlinge Verzekeringsmaatschappij \"Munis\") U.A.\n",
      "IZA Zorgverzekeraar N.V.\n",
      "DAS Nederlandse Rechtsbijstand Verzekeringmaatschappij N.V.\n",
      "Univé Stad en Land Brandverzekeraar N.V.\n",
      "ONVZ Ziektekostenverzekeraar N.V.\n",
      "DLE Natura Uitvaartverzekeringen N.V.\n",
      "Proteq Levensverzekeringen N.V.\n",
      "VGZ Zorgverzekeraar N.V.\n",
      "Univé Noord-Nederland Verzekeraar N.V.\n",
      "Blue Square Re N.V.\n",
      "SCILDON N.V.\n",
      "Achmea Zorgverzekeringen N.V.\n",
      "Onderlinge Levensverzekering-Maatschappij \"'s-Gravenhage\" U.A.\n",
      "Achmea Reinsurance Company N.V.\n",
      "Onderlinge Waarborgmaatschappij Sazas U.A.\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Zorgverzekeraar U.A.\n",
      "AnderZorg N.V.\n",
      "Goudse Schadeverzekeringen N.V.\n",
      "Ansvar Verzekeringsmaatschappij N.V.\n",
      "BNP PARIBAS CARDIF LEVENSVERZEKERINGEN N.V.\n",
      "Onderling Verzekerd U.A.\n",
      "ABN AMRO Levensverzekering N.V.\n",
      "Lifetri Verzekeringen N.V.\n",
      "ASR Levensverzekering N.V.\n",
      "De Friesland Zorgverzekeraar N.V.\n",
      "Achmea Schadeverzekeringen N.V.\n",
      "Uitvaartverzekering Twenthe N.V.\n",
      "VvAA schadeverzekeringen N.V.\n",
      "Univé Dichtbij Brandverzekeraar N.V.\n",
      "Stad Holland Zorgverzekeraar Onderlinge Waarborgmaatschappij U.A.\n",
      "Onderlinge Brandwaarborg Maatschappij Noord Holland U.A.\n",
      "AKZO Nobel Assurantie N.V.\n",
      "Anker Insurance Company N.V.\n",
      "Klaverblad Levensverzekering N.V.\n",
      "Onderlinge Waarborgmaatschappij Zorgverzekeraar Zorg en Zekerheid U.A.\n"
     ]
    }
   ],
   "source": [
    "# Who is the supervisor of <A>?\n",
    "# Who is <A>'s supervisor?\n",
    "# Supervisor of <A>?\n",
    "\n",
    "query = \"\"\"SELECT DISTINCT ?o\n",
    "           WHERE {?e eiopa-Base:hasIdentifyingName \"achmea schadeverzekeringen n.v.\" .\n",
    "                  ?e eiopa-Base:hasNCA ?o .\n",
    "}\"\"\"\n",
    "results = g.query(query)\n",
    "\n",
    "# SELECT DISTINCT ?o WHERE {?e eiopa-Base:hasIdentifyingName <A>. ?e eiopa-Base:hasNCA ?o.}\n",
    "\n",
    "for row in results:\n",
    "    print(row[0])\n",
    "\n",
    "generator_query = \"\"\" select distinct ?a where{\n",
    "                  ?s gleif-L1:hasLegalName ?a . \n",
    "                  ?e gleif-Base:identifies ?s .\n",
    "                  ?e eiopa-Base:hasEUCountryWhereEntityOperates CountryCodes:NL.\n",
    "                  ?e eiopa-Base:hasNCA [].\n",
    "}\"\"\"\n",
    "\n",
    "results = g.query(generator_query)\n",
    "for row in results:\n",
    "    print(get_name(row[0]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "W1686\n",
      "KMU Verzekeringen N.V.\n",
      "VIVAT Schadeverzekeringen N.V.\n",
      "Onderlinge Steenwijker Brandassurantie Vereniging U.A.\n",
      "Leidsche Verzekering Maatschappij N.V.\n",
      "Brand New Day Levensverzekeringen N.V.\n",
      "ABN AMRO Schadeverzekering N.V.\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Aanvullende Verzekering Zorgverzekeraar u.a.\n",
      "NN Non-Life Insurance N.V.\n",
      "Onderlinge Verzekerings Maatschappij \"De Onderlingen\" U.A.\n",
      "N.V. Zorgverzekeraar UMC\n",
      "Woningborg N.V.\n",
      "AEGON Levensverzekering N.V.\n",
      "N.V. Univé Zorg\n",
      "N.V. Schadeverzekeringsmaatschappij Maas Lloyd\n",
      "Achmea Pensioen- en Levensverzekeringen N.V.\n",
      "N.V. Levensverzekering-Maatschappij \"De Hoop\"\n",
      "OVM Onderlinge Verzekeringen U.A.\n",
      "Monuta Verzekeringen N.V.\n",
      "Interpolis Zorgverzekeringen N.V.\n",
      "Centrale Ziektekostenverzekering NZV N.V.\n",
      "N.V. Univé Schade\n",
      "N.V. Schadeverzekering Metaal en Technische Bedrijfstakken\n",
      "ONVZ Aanvullende Verzekering N.V.\n",
      "Actua Schadeverzekering N.V.\n",
      "VvAA Levensverzekeringen N.V.\n",
      "BNP PARIBAS CARDIF SCHADEVERZEKERINGEN N.V.\n",
      "N.V. Verzekeringsbedrijf Groot Amsterdam (VGA)\n",
      "Univé Zuid-Nederland Verzekeringen N.V.\n",
      "National Academic Verzekeringsmaatschappij N.V.\n",
      "Menzis Zorgverzekeraar N.V.\n",
      "Yarden Uitvaartverzekeringen N.V.\n",
      "Mercurius Schadeverzekeringen N.V.\n",
      "Menzis N.V.\n",
      "Bos Fruit Aardappelen Onderlinge verzekeringen BFAO U.A.\n",
      "Unilever Insurances N.V.\n",
      "N.V. Noordhollandsche van 1816, Levensverzekeringsmaatschappij\n",
      "Onderlinge Verzekeringsmaatschappij De Veenhoop u.a.\n",
      "TVM verzekeringen N.V.\n",
      "N.V. Verzekering Maatschappij \"De Burcht\"\n",
      "Robein Leven N.V.\n",
      "Nationale-Nederlanden Levensverzekering Maatschappij N.V.\n",
      "E.O.C. Onderlinge Schepenverzekering U.A.\n",
      "UK P&I Club N.V.\n",
      "OOM Global Care N.V.\n",
      "AEGON Schadeverzekering N.V.\n",
      "Univé Het Groene Hart Brandverzekeraar N.V.\n",
      "SRLEV N.V.\n",
      "Stichtsche Onderlinge Brand-Herverzekering U.A.\n",
      "ASSURANT EUROPE INSURANCE N.V.\n",
      "Enel Insurance N.V.\n",
      "N.V. Schadeverzekering-Maatschappij Bovemij\n",
      "ASR Schadeverzekering N.V.\n",
      "Onderlinge Verzekeringsmaatschappij \"Waterland en Omstreken U.A.\"\n",
      "de Vereende N.V.\n",
      "Univé Noord-Holland Brandverzekeraar N.V.\n",
      "Onderlinge Verzekerings-Maatschappij \"Noord Nederlandsche P&I Club\" U.A.\n",
      "Algemene Friese Onderlinge Schadeverzekeringsmaatschappij \"Zevenwouden\" U.A.\n",
      "Onderlinge Verzekering Maatschappij Donatus U.A.\n",
      "Onderlinge Waarborg Maatschappij Achterhoek U.A.\n",
      "N.V. Noordhollandsche van 1816, Schadeverzekeringsmaatschappij\n",
      "UVM Verzekeringsmaatschappij N.V.\n",
      "Goudse Levensverzekeringen N.V.\n",
      "Onderlinge Waarborgmaatschappij Centramed B.A.\n",
      "Onderlinge Verzekeringsmaatschappij Univé Samen U.A.\n",
      "NS Insurance N.V.\n",
      "FBTO Zorgverzekeringen N.V.\n",
      "OOM Schadeverzekering N.V.\n",
      "Waard Schade N.V.\n",
      "Eno Aanvullende Verzekeringen N.V.\n",
      "Zilveren Kruis Zorgverzekeringen N.V.\n",
      "OHRA Ziektekostenverzekeringen N.V.\n",
      "CZ Zorgverzekeringen N.V.\n",
      "NN Re (Netherlands) N.V.\n",
      "Roeminck Insurance N.V.\n",
      "ABN AMRO Captive N.V.\n",
      "Univé Oost Brandverzekeraar N.V.\n",
      "Onderlinge Verzekering Maatschappij ZLM U.A.\n",
      "Eno Zorgverzekeraar N.V.\n",
      "Onderling Fonds \"Sliedrecht\" B.A.\n",
      "Onderlinge Verzekerings Maatschappij Rijn en Aar U.A.\n",
      "Onderlinge Waarborgmaatschappij DSW Zorgverzekeraar U.A.\n",
      "Rabo Herverzekeringsmaatschappij N.V.\n",
      "DSW Ziektekostenverzekeringen N.V.\n",
      "N.V. Hagelunie\n",
      "ASSURANT EUROPE LIFE INSURANCE N.V.\n",
      "Glasassurantie Maatschappij Midglas N.V.\n",
      "Onderlinge Hagelverzekering Maatschappij Agriver B.A.\n",
      "ASR Basis Ziektekostenverzekeringen N.V.\n",
      "Waard Leven N.V.\n",
      "Eerste Friesche Onderlinge Paarden Verzekeringsmaatschappij U.A.\n",
      "Nationale-Nederlanden Schadeverzekering Maatschappij N.V.\n",
      "DELA Natura- en levensverzekeringen N.V.\n",
      "Onderlinge Waarborgmaatschappij voor Instellingen in de Gezondheidszorg MediRisk B.A.\n",
      "Reis- en Rechtshulp N.V.\n",
      "Onderlinge Verzekering Maatschappij Twente U.A.\n",
      "AEGON Spaarkas N.V.\n",
      "ASR Aanvullende Ziektekostenverzekeringen N.V.\n",
      "Lifetri Uitvaartverzekeringen N.V.\n",
      "Lemonade Insurance N.V.\n",
      "Onderlinge Verzekeringmaatschappij \"SOM\" U.A.\n",
      "Samenwerking Glasverzekering N.V.\n",
      "Klaverblad Schadeverzekeringsmaatschappij N.V.\n",
      "N.V. Univé Her\n",
      "Mutual Insurance Association \"Munis\" (Onderlinge Verzekeringsmaatschappij \"Munis\") U.A.\n",
      "IZA Zorgverzekeraar N.V.\n",
      "DAS Nederlandse Rechtsbijstand Verzekeringmaatschappij N.V.\n",
      "Univé Stad en Land Brandverzekeraar N.V.\n",
      "ONVZ Ziektekostenverzekeraar N.V.\n",
      "DLE Natura Uitvaartverzekeringen N.V.\n",
      "Proteq Levensverzekeringen N.V.\n",
      "VGZ Zorgverzekeraar N.V.\n",
      "Univé Noord-Nederland Verzekeraar N.V.\n",
      "Blue Square Re N.V.\n",
      "SCILDON N.V.\n",
      "Achmea Zorgverzekeringen N.V.\n",
      "Onderlinge Levensverzekering-Maatschappij \"'s-Gravenhage\" U.A.\n",
      "Achmea Reinsurance Company N.V.\n",
      "Onderlinge Waarborgmaatschappij Sazas U.A.\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Zorgverzekeraar U.A.\n",
      "AnderZorg N.V.\n",
      "Goudse Schadeverzekeringen N.V.\n",
      "Ansvar Verzekeringsmaatschappij N.V.\n",
      "BNP PARIBAS CARDIF LEVENSVERZEKERINGEN N.V.\n",
      "Onderling Verzekerd U.A.\n",
      "ABN AMRO Levensverzekering N.V.\n",
      "Lifetri Verzekeringen N.V.\n",
      "ASR Levensverzekering N.V.\n",
      "De Friesland Zorgverzekeraar N.V.\n",
      "Achmea Schadeverzekeringen N.V.\n",
      "Uitvaartverzekering Twenthe N.V.\n",
      "VvAA schadeverzekeringen N.V.\n",
      "Univé Dichtbij Brandverzekeraar N.V.\n",
      "Stad Holland Zorgverzekeraar Onderlinge Waarborgmaatschappij U.A.\n",
      "Onderlinge Brandwaarborg Maatschappij Noord Holland U.A.\n",
      "AKZO Nobel Assurantie N.V.\n",
      "Anker Insurance Company N.V.\n",
      "Klaverblad Levensverzekering N.V.\n",
      "Onderlinge Waarborgmaatschappij Zorgverzekeraar Zorg en Zekerheid U.A.\n"
     ]
    }
   ],
   "source": [
    "# What is the register name of <A>?\n",
    "# What is <A>'s register name?\n",
    "# What is the relatienummer of <A>?\n",
    "# What is <A>'s relatienummer?\n",
    "# Register name of <A>?\n",
    "# Relatienummer of <A>?\n",
    "\n",
    "query = \"\"\"SELECT DISTINCT ?a\n",
    "           WHERE {?e eiopa-Base:hasIdentifyingName \"achmea schadeverzekeringen n.v.\" .\n",
    "                  ?e eiopa-Base:hasInsuranceUndertakingID ?a .\n",
    "}\"\"\"\n",
    "results = g.query(query)\n",
    "\n",
    "# SELECT DISTINCT ?a WHERE {?e eiopa-Base:hasIdentifyingName <A>. ?e eiopa-Base:hasInsuranceUndertakingID ?a .}\n",
    "\n",
    "for row in results:\n",
    "    print(row[0])\n",
    "\n",
    "generator_query = \"\"\" select distinct ?a where{\n",
    "                  ?s gleif-L1:hasLegalName ?a . \n",
    "                  ?e gleif-Base:identifies ?s .\n",
    "                  ?e eiopa-Base:hasInsuranceUndertakingID [].\n",
    "                  ?e eiopa-Base:hasEUCountryWhereEntityOperates CountryCodes:NL.\n",
    "}\"\"\"\n",
    "\n",
    "results = g.query(generator_query)\n",
    "for row in results:\n",
    "    print(get_name(row[0]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Achmea Schadeverzekeringen N.V.\n",
      "W1972\n",
      "W0083\n",
      "W0186\n",
      "L0151\n",
      "L0182\n",
      "W1219\n",
      "W1423\n",
      "W1680\n",
      "W0192\n",
      "W1909\n",
      "W1940\n",
      "L0077\n",
      "W1877\n",
      "W0319\n",
      "L0180\n",
      "H0088\n",
      "W0355\n",
      "L0104\n",
      "W1911\n",
      "W1619\n",
      "W1875\n",
      "W1727\n",
      "W1886\n",
      "W1702\n",
      "L0093\n",
      "W1840\n",
      "W0064\n",
      "W1969\n",
      "W1910\n",
      "W1978\n",
      "N0015\n",
      "W0060\n",
      "W1977\n",
      "W1104\n",
      "W0143\n",
      "L0215\n",
      "W0302\n",
      "W1986\n",
      "W1642\n",
      "L0116\n",
      "L0046\n",
      "W0219\n",
      "R161589\n",
      "W1743\n",
      "W0065\n",
      "W1976\n",
      "L0216\n",
      "H0089\n",
      "R161237\n",
      "W1988\n",
      "W0145\n",
      "W0132\n",
      "W1711\n",
      "W1031\n",
      "W1938\n",
      "W0389\n",
      "W0174\n",
      "W0164\n",
      "W0393\n",
      "W0087\n",
      "W1650\n",
      "L0017\n",
      "W1752\n",
      "W0281\n",
      "W1805\n",
      "W1913\n",
      "W1749\n",
      "W1767\n",
      "W1943\n",
      "W1817\n",
      "W1710\n",
      "W1889\n",
      "H0073\n",
      "W1958\n",
      "H0132\n",
      "W1961\n",
      "W0128\n",
      "W1942\n",
      "L0025\n",
      "W0344\n",
      "W1899\n",
      "H0125\n",
      "W1576\n",
      "W1487\n",
      "R161238\n",
      "W1258\n",
      "W0449\n",
      "W1921\n",
      "L0155\n",
      "W1292\n",
      "W0123\n",
      "L0171\n",
      "W1706\n",
      "W1589\n",
      "W1090\n",
      "L0008\n",
      "W1922\n",
      "R140252\n",
      "R162036\n",
      "W1806\n",
      "W1974\n",
      "W0109\n",
      "H0134\n",
      "W1497\n",
      "W1908\n",
      "W1027\n",
      "W1954\n",
      "W1788\n",
      "N0042\n",
      "L0131\n",
      "W1920\n",
      "W1963\n",
      "H0133\n",
      "L0119\n",
      "W1825\n",
      "L0029\n",
      "H0074\n",
      "W1789\n",
      "W1906\n",
      "W1981\n",
      "W0035\n",
      "W0147\n",
      "L0187\n",
      "W1868\n",
      "L0150\n",
      "R140256\n",
      "L0058\n",
      "W1983\n",
      "W1686\n",
      "N0048\n",
      "W0010\n",
      "W1973\n",
      "W1902\n",
      "W0301\n",
      "W1709\n",
      "W1860\n",
      "L0129\n",
      "W1904\n"
     ]
    }
   ],
   "source": [
    "# What is the legal name of <A>?\n",
    "# What is <A>'s legal name?\n",
    "# Legal name of <A>?\n",
    "# <A>'s legal name?\n",
    "\n",
    "query = \"\"\"SELECT DISTINCT ?o\n",
    "           WHERE {?s gleif-L1:hasLegalName ?o . \n",
    "                  ?e gleif-Base:identifies ?s .\n",
    "                  ?e eiopa-Base:hasInsuranceUndertakingID \"W1686\" .\n",
    "}\"\"\"\n",
    "results = g.query(query)\n",
    "\n",
    "# SELECT DISTINCT ?o WHERE {?s gleif-L1:hasLegalName ?o . ?e gleif-Base:identifies ?s . ?e eiopa-Base:hasInsuranceUndertakingID <A> .}\n",
    "\n",
    "for row in results:\n",
    "    print(row[0])\n",
    "    \n",
    "generator_query = \"\"\" select distinct ?a where{\n",
    "                  ?e eiopa-Base:hasEUCountryWhereEntityOperates CountryCodes:NL .\n",
    "                  ?e eiopa-Base:hasInsuranceUndertakingID ?a.\n",
    "                  ?e gleif-Base:identifies ?s.\n",
    "                  ?s gleif-L1:hasLegalName [].\n",
    "}\"\"\"\n",
    "\n",
    "results = g.query(generator_query)\n",
    "for row in results:\n",
    "    print(get_name(row[0]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Domestic undertaking\n",
      "KMU Verzekeringen N.V.\n",
      "VIVAT Schadeverzekeringen N.V.\n",
      "Onderlinge Steenwijker Brandassurantie Vereniging U.A.\n",
      "Leidsche Verzekering Maatschappij N.V.\n",
      "Brand New Day Levensverzekeringen N.V.\n",
      "ABN AMRO Schadeverzekering N.V.\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Aanvullende Verzekering Zorgverzekeraar u.a.\n",
      "NN Non-Life Insurance N.V.\n",
      "Onderlinge Verzekerings Maatschappij \"De Onderlingen\" U.A.\n",
      "N.V. Zorgverzekeraar UMC\n",
      "Woningborg N.V.\n",
      "AEGON Levensverzekering N.V.\n",
      "N.V. Univé Zorg\n",
      "N.V. Schadeverzekeringsmaatschappij Maas Lloyd\n",
      "Achmea Pensioen- en Levensverzekeringen N.V.\n",
      "N.V. Levensverzekering-Maatschappij \"De Hoop\"\n",
      "OVM Onderlinge Verzekeringen U.A.\n",
      "Monuta Verzekeringen N.V.\n",
      "Interpolis Zorgverzekeringen N.V.\n",
      "Centrale Ziektekostenverzekering NZV N.V.\n",
      "N.V. Univé Schade\n",
      "N.V. Schadeverzekering Metaal en Technische Bedrijfstakken\n",
      "ONVZ Aanvullende Verzekering N.V.\n",
      "Actua Schadeverzekering N.V.\n",
      "VvAA Levensverzekeringen N.V.\n",
      "BNP PARIBAS CARDIF SCHADEVERZEKERINGEN N.V.\n",
      "N.V. Verzekeringsbedrijf Groot Amsterdam (VGA)\n",
      "Univé Zuid-Nederland Verzekeringen N.V.\n",
      "National Academic Verzekeringsmaatschappij N.V.\n",
      "Menzis Zorgverzekeraar N.V.\n",
      "Yarden Uitvaartverzekeringen N.V.\n",
      "Mercurius Schadeverzekeringen N.V.\n",
      "Menzis N.V.\n",
      "Bos Fruit Aardappelen Onderlinge verzekeringen BFAO U.A.\n",
      "Unilever Insurances N.V.\n",
      "N.V. Noordhollandsche van 1816, Levensverzekeringsmaatschappij\n",
      "Onderlinge Verzekeringsmaatschappij De Veenhoop u.a.\n",
      "TVM verzekeringen N.V.\n",
      "N.V. Verzekering Maatschappij \"De Burcht\"\n",
      "Robein Leven N.V.\n",
      "Nationale-Nederlanden Levensverzekering Maatschappij N.V.\n",
      "E.O.C. Onderlinge Schepenverzekering U.A.\n",
      "UK P&I Club N.V.\n",
      "OOM Global Care N.V.\n",
      "AEGON Schadeverzekering N.V.\n",
      "Univé Het Groene Hart Brandverzekeraar N.V.\n",
      "SRLEV N.V.\n",
      "Stichtsche Onderlinge Brand-Herverzekering U.A.\n",
      "ASSURANT EUROPE INSURANCE N.V.\n",
      "Enel Insurance N.V.\n",
      "N.V. Schadeverzekering-Maatschappij Bovemij\n",
      "ASR Schadeverzekering N.V.\n",
      "Onderlinge Verzekeringsmaatschappij \"Waterland en Omstreken U.A.\"\n",
      "de Vereende N.V.\n",
      "Univé Noord-Holland Brandverzekeraar N.V.\n",
      "Onderlinge Verzekerings-Maatschappij \"Noord Nederlandsche P&I Club\" U.A.\n",
      "Algemene Friese Onderlinge Schadeverzekeringsmaatschappij \"Zevenwouden\" U.A.\n",
      "Onderlinge Verzekering Maatschappij Donatus U.A.\n",
      "Onderlinge Waarborg Maatschappij Achterhoek U.A.\n",
      "N.V. Noordhollandsche van 1816, Schadeverzekeringsmaatschappij\n",
      "UVM Verzekeringsmaatschappij N.V.\n",
      "Goudse Levensverzekeringen N.V.\n",
      "Onderlinge Waarborgmaatschappij Centramed B.A.\n",
      "Onderlinge Verzekeringsmaatschappij Univé Samen U.A.\n",
      "NS Insurance N.V.\n",
      "FBTO Zorgverzekeringen N.V.\n",
      "OOM Schadeverzekering N.V.\n",
      "Waard Schade N.V.\n",
      "Eno Aanvullende Verzekeringen N.V.\n",
      "Zilveren Kruis Zorgverzekeringen N.V.\n",
      "OHRA Ziektekostenverzekeringen N.V.\n",
      "CZ Zorgverzekeringen N.V.\n",
      "NN Re (Netherlands) N.V.\n",
      "Roeminck Insurance N.V.\n",
      "ABN AMRO Captive N.V.\n",
      "Univé Oost Brandverzekeraar N.V.\n",
      "Onderlinge Verzekering Maatschappij ZLM U.A.\n",
      "Eno Zorgverzekeraar N.V.\n",
      "Onderling Fonds \"Sliedrecht\" B.A.\n",
      "Onderlinge Verzekerings Maatschappij Rijn en Aar U.A.\n",
      "Onderlinge Waarborgmaatschappij DSW Zorgverzekeraar U.A.\n",
      "Rabo Herverzekeringsmaatschappij N.V.\n",
      "DSW Ziektekostenverzekeringen N.V.\n",
      "N.V. Hagelunie\n",
      "ASSURANT EUROPE LIFE INSURANCE N.V.\n",
      "Glasassurantie Maatschappij Midglas N.V.\n",
      "Onderlinge Hagelverzekering Maatschappij Agriver B.A.\n",
      "ASR Basis Ziektekostenverzekeringen N.V.\n",
      "Waard Leven N.V.\n",
      "Eerste Friesche Onderlinge Paarden Verzekeringsmaatschappij U.A.\n",
      "Nationale-Nederlanden Schadeverzekering Maatschappij N.V.\n",
      "DELA Natura- en levensverzekeringen N.V.\n",
      "Onderlinge Waarborgmaatschappij voor Instellingen in de Gezondheidszorg MediRisk B.A.\n",
      "Reis- en Rechtshulp N.V.\n",
      "Onderlinge Verzekering Maatschappij Twente U.A.\n",
      "AEGON Spaarkas N.V.\n",
      "ASR Aanvullende Ziektekostenverzekeringen N.V.\n",
      "Lifetri Uitvaartverzekeringen N.V.\n",
      "Lemonade Insurance N.V.\n",
      "Onderlinge Verzekeringmaatschappij \"SOM\" U.A.\n",
      "Samenwerking Glasverzekering N.V.\n",
      "Klaverblad Schadeverzekeringsmaatschappij N.V.\n",
      "N.V. Univé Her\n",
      "Mutual Insurance Association \"Munis\" (Onderlinge Verzekeringsmaatschappij \"Munis\") U.A.\n",
      "IZA Zorgverzekeraar N.V.\n",
      "DAS Nederlandse Rechtsbijstand Verzekeringmaatschappij N.V.\n",
      "Univé Stad en Land Brandverzekeraar N.V.\n",
      "ONVZ Ziektekostenverzekeraar N.V.\n",
      "DLE Natura Uitvaartverzekeringen N.V.\n",
      "Proteq Levensverzekeringen N.V.\n",
      "VGZ Zorgverzekeraar N.V.\n",
      "Univé Noord-Nederland Verzekeraar N.V.\n",
      "Blue Square Re N.V.\n",
      "SCILDON N.V.\n",
      "Achmea Zorgverzekeringen N.V.\n",
      "Onderlinge Levensverzekering-Maatschappij \"'s-Gravenhage\" U.A.\n",
      "Achmea Reinsurance Company N.V.\n",
      "Onderlinge Waarborgmaatschappij Sazas U.A.\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Zorgverzekeraar U.A.\n",
      "AnderZorg N.V.\n",
      "Goudse Schadeverzekeringen N.V.\n",
      "Ansvar Verzekeringsmaatschappij N.V.\n",
      "BNP PARIBAS CARDIF LEVENSVERZEKERINGEN N.V.\n",
      "Onderling Verzekerd U.A.\n",
      "ABN AMRO Levensverzekering N.V.\n",
      "Lifetri Verzekeringen N.V.\n",
      "ASR Levensverzekering N.V.\n",
      "De Friesland Zorgverzekeraar N.V.\n",
      "Achmea Schadeverzekeringen N.V.\n",
      "Uitvaartverzekering Twenthe N.V.\n",
      "VvAA schadeverzekeringen N.V.\n",
      "Univé Dichtbij Brandverzekeraar N.V.\n",
      "Stad Holland Zorgverzekeraar Onderlinge Waarborgmaatschappij U.A.\n",
      "Onderlinge Brandwaarborg Maatschappij Noord Holland U.A.\n",
      "AKZO Nobel Assurantie N.V.\n",
      "Anker Insurance Company N.V.\n",
      "Klaverblad Levensverzekering N.V.\n",
      "Onderlinge Waarborgmaatschappij Zorgverzekeraar Zorg en Zekerheid U.A.\n"
     ]
    }
   ],
   "source": [
    "# What is the cross border status of <A>?\n",
    "# What is <A>'s cross border status?\n",
    "# Cross border status of <A>?\n",
    "# <A>'s cross border status\n",
    "\n",
    "query = \"\"\"SELECT DISTINCT ?o\n",
    "           WHERE {?e eiopa-Base:hasIdentifyingName \"achmea schadeverzekeringen n.v.\".\n",
    "                  ?e eiopa-Base:hasCrossBorderStatus ?o .\n",
    "}\"\"\"\n",
    "results = g.query(query)\n",
    "\n",
    "# SELECT DISTINCT ?o WHERE {?e eiopa-Base:hasIdentifyingName <A>. ?e eiopa-Base:hasCrossBorderStatus ?o .}\n",
    "\n",
    "for row in results:\n",
    "    print(row[0])\n",
    "    \n",
    "generator_query = \"\"\" select distinct ?a where{\n",
    "                  ?s gleif-L1:hasLegalName ?a . \n",
    "                  ?e gleif-Base:identifies ?s .\n",
    "                  ?e eiopa-Base:hasCrossBorderStatus [].\n",
    "                  ?e eiopa-Base:hasEUCountryWhereEntityOperates CountryCodes:NL.\n",
    "}\"\"\"\n",
    "\n",
    "results = g.query(generator_query)\n",
    "for row in results:\n",
    "    print(get_name(row[0]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "23/12/1991 01:00:00\n",
      "KMU Verzekeringen N.V.\n",
      "VIVAT Schadeverzekeringen N.V.\n",
      "Onderlinge Steenwijker Brandassurantie Vereniging U.A.\n",
      "Leidsche Verzekering Maatschappij N.V.\n",
      "Brand New Day Levensverzekeringen N.V.\n",
      "ABN AMRO Schadeverzekering N.V.\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Aanvullende Verzekering Zorgverzekeraar u.a.\n",
      "NN Non-Life Insurance N.V.\n",
      "Onderlinge Verzekerings Maatschappij \"De Onderlingen\" U.A.\n",
      "N.V. Zorgverzekeraar UMC\n",
      "Woningborg N.V.\n",
      "AEGON Levensverzekering N.V.\n",
      "N.V. Univé Zorg\n",
      "N.V. Schadeverzekeringsmaatschappij Maas Lloyd\n",
      "Achmea Pensioen- en Levensverzekeringen N.V.\n",
      "N.V. Levensverzekering-Maatschappij \"De Hoop\"\n",
      "OVM Onderlinge Verzekeringen U.A.\n",
      "Monuta Verzekeringen N.V.\n",
      "Interpolis Zorgverzekeringen N.V.\n",
      "Centrale Ziektekostenverzekering NZV N.V.\n",
      "N.V. Univé Schade\n",
      "N.V. Schadeverzekering Metaal en Technische Bedrijfstakken\n",
      "ONVZ Aanvullende Verzekering N.V.\n",
      "Actua Schadeverzekering N.V.\n",
      "VvAA Levensverzekeringen N.V.\n",
      "BNP PARIBAS CARDIF SCHADEVERZEKERINGEN N.V.\n",
      "N.V. Verzekeringsbedrijf Groot Amsterdam (VGA)\n",
      "Univé Zuid-Nederland Verzekeringen N.V.\n",
      "National Academic Verzekeringsmaatschappij N.V.\n",
      "Menzis Zorgverzekeraar N.V.\n",
      "Yarden Uitvaartverzekeringen N.V.\n",
      "Mercurius Schadeverzekeringen N.V.\n",
      "Menzis N.V.\n",
      "Bos Fruit Aardappelen Onderlinge verzekeringen BFAO U.A.\n",
      "Unilever Insurances N.V.\n",
      "N.V. Noordhollandsche van 1816, Levensverzekeringsmaatschappij\n",
      "Onderlinge Verzekeringsmaatschappij De Veenhoop u.a.\n",
      "TVM verzekeringen N.V.\n",
      "N.V. Verzekering Maatschappij \"De Burcht\"\n",
      "Robein Leven N.V.\n",
      "Nationale-Nederlanden Levensverzekering Maatschappij N.V.\n",
      "E.O.C. Onderlinge Schepenverzekering U.A.\n",
      "UK P&I Club N.V.\n",
      "OOM Global Care N.V.\n",
      "AEGON Schadeverzekering N.V.\n",
      "Univé Het Groene Hart Brandverzekeraar N.V.\n",
      "SRLEV N.V.\n",
      "Stichtsche Onderlinge Brand-Herverzekering U.A.\n",
      "ASSURANT EUROPE INSURANCE N.V.\n",
      "Enel Insurance N.V.\n",
      "N.V. Schadeverzekering-Maatschappij Bovemij\n",
      "ASR Schadeverzekering N.V.\n",
      "Onderlinge Verzekeringsmaatschappij \"Waterland en Omstreken U.A.\"\n",
      "de Vereende N.V.\n",
      "Univé Noord-Holland Brandverzekeraar N.V.\n",
      "Onderlinge Verzekerings-Maatschappij \"Noord Nederlandsche P&I Club\" U.A.\n",
      "Algemene Friese Onderlinge Schadeverzekeringsmaatschappij \"Zevenwouden\" U.A.\n",
      "Onderlinge Verzekering Maatschappij Donatus U.A.\n",
      "Onderlinge Waarborg Maatschappij Achterhoek U.A.\n",
      "N.V. Noordhollandsche van 1816, Schadeverzekeringsmaatschappij\n",
      "UVM Verzekeringsmaatschappij N.V.\n",
      "Goudse Levensverzekeringen N.V.\n",
      "Onderlinge Waarborgmaatschappij Centramed B.A.\n",
      "Onderlinge Verzekeringsmaatschappij Univé Samen U.A.\n",
      "NS Insurance N.V.\n",
      "FBTO Zorgverzekeringen N.V.\n",
      "OOM Schadeverzekering N.V.\n",
      "Waard Schade N.V.\n",
      "Eno Aanvullende Verzekeringen N.V.\n",
      "Zilveren Kruis Zorgverzekeringen N.V.\n",
      "OHRA Ziektekostenverzekeringen N.V.\n",
      "CZ Zorgverzekeringen N.V.\n",
      "NN Re (Netherlands) N.V.\n",
      "Roeminck Insurance N.V.\n",
      "ABN AMRO Captive N.V.\n",
      "Univé Oost Brandverzekeraar N.V.\n",
      "Onderlinge Verzekering Maatschappij ZLM U.A.\n",
      "Eno Zorgverzekeraar N.V.\n",
      "Onderling Fonds \"Sliedrecht\" B.A.\n",
      "Onderlinge Verzekerings Maatschappij Rijn en Aar U.A.\n",
      "Onderlinge Waarborgmaatschappij DSW Zorgverzekeraar U.A.\n",
      "Rabo Herverzekeringsmaatschappij N.V.\n",
      "DSW Ziektekostenverzekeringen N.V.\n",
      "N.V. Hagelunie\n",
      "ASSURANT EUROPE LIFE INSURANCE N.V.\n",
      "Glasassurantie Maatschappij Midglas N.V.\n",
      "Onderlinge Hagelverzekering Maatschappij Agriver B.A.\n",
      "ASR Basis Ziektekostenverzekeringen N.V.\n",
      "Waard Leven N.V.\n",
      "Eerste Friesche Onderlinge Paarden Verzekeringsmaatschappij U.A.\n",
      "Nationale-Nederlanden Schadeverzekering Maatschappij N.V.\n",
      "DELA Natura- en levensverzekeringen N.V.\n",
      "Onderlinge Waarborgmaatschappij voor Instellingen in de Gezondheidszorg MediRisk B.A.\n",
      "Reis- en Rechtshulp N.V.\n",
      "Onderlinge Verzekering Maatschappij Twente U.A.\n",
      "AEGON Spaarkas N.V.\n",
      "ASR Aanvullende Ziektekostenverzekeringen N.V.\n",
      "Lifetri Uitvaartverzekeringen N.V.\n",
      "Lemonade Insurance N.V.\n",
      "Onderlinge Verzekeringmaatschappij \"SOM\" U.A.\n",
      "Samenwerking Glasverzekering N.V.\n",
      "Klaverblad Schadeverzekeringsmaatschappij N.V.\n",
      "N.V. Univé Her\n",
      "Mutual Insurance Association \"Munis\" (Onderlinge Verzekeringsmaatschappij \"Munis\") U.A.\n",
      "IZA Zorgverzekeraar N.V.\n",
      "DAS Nederlandse Rechtsbijstand Verzekeringmaatschappij N.V.\n",
      "Univé Stad en Land Brandverzekeraar N.V.\n",
      "ONVZ Ziektekostenverzekeraar N.V.\n",
      "DLE Natura Uitvaartverzekeringen N.V.\n",
      "Proteq Levensverzekeringen N.V.\n",
      "VGZ Zorgverzekeraar N.V.\n",
      "Univé Noord-Nederland Verzekeraar N.V.\n",
      "Blue Square Re N.V.\n",
      "SCILDON N.V.\n",
      "Achmea Zorgverzekeringen N.V.\n",
      "Onderlinge Levensverzekering-Maatschappij \"'s-Gravenhage\" U.A.\n",
      "Achmea Reinsurance Company N.V.\n",
      "Onderlinge Waarborgmaatschappij Sazas U.A.\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Zorgverzekeraar U.A.\n",
      "AnderZorg N.V.\n",
      "Goudse Schadeverzekeringen N.V.\n",
      "Ansvar Verzekeringsmaatschappij N.V.\n",
      "BNP PARIBAS CARDIF LEVENSVERZEKERINGEN N.V.\n",
      "Onderling Verzekerd U.A.\n",
      "ABN AMRO Levensverzekering N.V.\n",
      "Lifetri Verzekeringen N.V.\n",
      "ASR Levensverzekering N.V.\n",
      "De Friesland Zorgverzekeraar N.V.\n",
      "Achmea Schadeverzekeringen N.V.\n",
      "Uitvaartverzekering Twenthe N.V.\n",
      "VvAA schadeverzekeringen N.V.\n",
      "Univé Dichtbij Brandverzekeraar N.V.\n",
      "Stad Holland Zorgverzekeraar Onderlinge Waarborgmaatschappij U.A.\n",
      "Onderlinge Brandwaarborg Maatschappij Noord Holland U.A.\n",
      "AKZO Nobel Assurantie N.V.\n",
      "Anker Insurance Company N.V.\n",
      "Klaverblad Levensverzekering N.V.\n",
      "Onderlinge Waarborgmaatschappij Zorgverzekeraar Zorg en Zekerheid U.A.\n"
     ]
    }
   ],
   "source": [
    "# When did <A> start?\n",
    "# From when did <A> start?\n",
    "# What is the starting date of <A>?\n",
    "# What is <A>'s starting date?\n",
    "# What is the operation starting date of <A>?\n",
    "# What is <A>'s operation starting date?\n",
    "\n",
    "query = \"\"\"SELECT DISTINCT ?o\n",
    "           WHERE {?e eiopa-Base:hasIdentifyingName \"achmea schadeverzekeringen n.v.\".\n",
    "                  ?e eiopa-Base:hasOperationStartDate ?o .\n",
    "}\"\"\"\n",
    "results = g.query(query)\n",
    "\n",
    "# SELECT DISTINCT ?o WHERE {?e eiopa-Base:hasIdentifyingName <A>. ?e eiopa-Base:hasOperationStartDate ?o.}\n",
    "\n",
    "for row in results:\n",
    "    print(row[0])\n",
    "    \n",
    "generator_query = \"\"\" select distinct ?a where{\n",
    "                  ?s gleif-L1:hasLegalName ?a . \n",
    "                  ?e gleif-Base:identifies ?s .\n",
    "                  ?e eiopa-Base:hasOperationStartDate [] .\n",
    "                  ?e eiopa-Base:hasEUCountryWhereEntityOperates CountryCodes:NL.\n",
    "}\"\"\"\n",
    "\n",
    "results = g.query(generator_query)\n",
    "for row in results:\n",
    "    print(get_name(row[0]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Leiden W1825 \n",
      "\n",
      "KMU Verzekeringen N.V. \n",
      "\n",
      "VIVAT Schadeverzekeringen N.V. \n",
      "\n",
      "Onderlinge Steenwijker Brandassurantie Vereniging U.A. \n",
      "\n",
      "Leidsche Verzekering Maatschappij N.V. \n",
      "\n",
      "Brand New Day Levensverzekeringen N.V. \n",
      "\n",
      "ABN AMRO Schadeverzekering N.V. \n",
      "\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Aanvullende Verzekering Zorgverzekeraar u.a. \n",
      "\n",
      "NN Non-Life Insurance N.V. \n",
      "\n",
      "Onderlinge Verzekerings Maatschappij \"De Onderlingen\" U.A. \n",
      "\n",
      "N.V. Zorgverzekeraar UMC \n",
      "\n",
      "Woningborg N.V. \n",
      "\n",
      "AEGON Levensverzekering N.V. \n",
      "\n",
      "N.V. Univé Zorg \n",
      "\n",
      "N.V. Schadeverzekeringsmaatschappij Maas Lloyd \n",
      "\n",
      "Achmea Pensioen- en Levensverzekeringen N.V. \n",
      "\n",
      "N.V. Levensverzekering-Maatschappij \"De Hoop\" \n",
      "\n",
      "OVM Onderlinge Verzekeringen U.A. \n",
      "\n",
      "Monuta Verzekeringen N.V. \n",
      "\n",
      "Interpolis Zorgverzekeringen N.V. \n",
      "\n",
      "Centrale Ziektekostenverzekering NZV N.V. \n",
      "\n",
      "N.V. Univé Schade \n",
      "\n",
      "N.V. Schadeverzekering Metaal en Technische Bedrijfstakken \n",
      "\n",
      "ONVZ Aanvullende Verzekering N.V. \n",
      "\n",
      "Actua Schadeverzekering N.V. \n",
      "\n",
      "VvAA Levensverzekeringen N.V. \n",
      "\n",
      "BNP PARIBAS CARDIF SCHADEVERZEKERINGEN N.V. \n",
      "\n",
      "N.V. Verzekeringsbedrijf Groot Amsterdam (VGA) \n",
      "\n",
      "Univé Zuid-Nederland Verzekeringen N.V. \n",
      "\n",
      "National Academic Verzekeringsmaatschappij N.V. \n",
      "\n",
      "Menzis Zorgverzekeraar N.V. \n",
      "\n",
      "Yarden Uitvaartverzekeringen N.V. \n",
      "\n",
      "Mercurius Schadeverzekeringen N.V. \n",
      "\n",
      "Menzis N.V. \n",
      "\n",
      "Bos Fruit Aardappelen Onderlinge verzekeringen BFAO U.A. \n",
      "\n",
      "Unilever Insurances N.V. \n",
      "\n",
      "N.V. Noordhollandsche van 1816, Levensverzekeringsmaatschappij \n",
      "\n",
      "Onderlinge Verzekeringsmaatschappij De Veenhoop u.a. \n",
      "\n",
      "TVM verzekeringen N.V. \n",
      "\n",
      "N.V. Verzekering Maatschappij \"De Burcht\" \n",
      "\n",
      "Robein Leven N.V. \n",
      "\n",
      "Nationale-Nederlanden Levensverzekering Maatschappij N.V. \n",
      "\n",
      "E.O.C. Onderlinge Schepenverzekering U.A. \n",
      "\n",
      "UK P&I Club N.V. \n",
      "\n",
      "OOM Global Care N.V. \n",
      "\n",
      "AEGON Schadeverzekering N.V. \n",
      "\n",
      "Univé Het Groene Hart Brandverzekeraar N.V. \n",
      "\n",
      "SRLEV N.V. \n",
      "\n",
      "Stichtsche Onderlinge Brand-Herverzekering U.A. \n",
      "\n",
      "ASSURANT EUROPE INSURANCE N.V. \n",
      "\n",
      "Enel Insurance N.V. \n",
      "\n",
      "N.V. Schadeverzekering-Maatschappij Bovemij \n",
      "\n",
      "ASR Schadeverzekering N.V. \n",
      "\n",
      "Onderlinge Verzekeringsmaatschappij \"Waterland en Omstreken U.A.\" \n",
      "\n",
      "de Vereende N.V. \n",
      "\n",
      "Univé Noord-Holland Brandverzekeraar N.V. \n",
      "\n",
      "Onderlinge Verzekerings-Maatschappij \"Noord Nederlandsche P&I Club\" U.A. \n",
      "\n",
      "Algemene Friese Onderlinge Schadeverzekeringsmaatschappij \"Zevenwouden\" U.A. \n",
      "\n",
      "Onderlinge Verzekering Maatschappij Donatus U.A. \n",
      "\n",
      "Onderlinge Waarborg Maatschappij Achterhoek U.A. \n",
      "\n",
      "N.V. Noordhollandsche van 1816, Schadeverzekeringsmaatschappij \n",
      "\n",
      "UVM Verzekeringsmaatschappij N.V. \n",
      "\n",
      "Goudse Levensverzekeringen N.V. \n",
      "\n",
      "Onderlinge Waarborgmaatschappij Centramed B.A. \n",
      "\n",
      "Onderlinge Verzekeringsmaatschappij Univé Samen U.A. \n",
      "\n",
      "NS Insurance N.V. \n",
      "\n",
      "FBTO Zorgverzekeringen N.V. \n",
      "\n",
      "OOM Schadeverzekering N.V. \n",
      "\n",
      "Waard Schade N.V. \n",
      "\n",
      "Eno Aanvullende Verzekeringen N.V. \n",
      "\n",
      "Zilveren Kruis Zorgverzekeringen N.V. \n",
      "\n",
      "OHRA Ziektekostenverzekeringen N.V. \n",
      "\n",
      "CZ Zorgverzekeringen N.V. \n",
      "\n",
      "NN Re (Netherlands) N.V. \n",
      "\n",
      "Roeminck Insurance N.V. \n",
      "\n",
      "ABN AMRO Captive N.V. \n",
      "\n",
      "Univé Oost Brandverzekeraar N.V. \n",
      "\n",
      "Onderlinge Verzekering Maatschappij ZLM U.A. \n",
      "\n",
      "Eno Zorgverzekeraar N.V. \n",
      "\n",
      "Onderling Fonds \"Sliedrecht\" B.A. \n",
      "\n",
      "Onderlinge Verzekerings Maatschappij Rijn en Aar U.A. \n",
      "\n",
      "Onderlinge Waarborgmaatschappij DSW Zorgverzekeraar U.A. \n",
      "\n",
      "Rabo Herverzekeringsmaatschappij N.V. \n",
      "\n",
      "DSW Ziektekostenverzekeringen N.V. \n",
      "\n",
      "N.V. Hagelunie \n",
      "\n",
      "ASSURANT EUROPE LIFE INSURANCE N.V. \n",
      "\n",
      "Glasassurantie Maatschappij Midglas N.V. \n",
      "\n",
      "Onderlinge Hagelverzekering Maatschappij Agriver B.A. \n",
      "\n",
      "ASR Basis Ziektekostenverzekeringen N.V. \n",
      "\n",
      "Waard Leven N.V. \n",
      "\n",
      "Eerste Friesche Onderlinge Paarden Verzekeringsmaatschappij U.A. \n",
      "\n",
      "Nationale-Nederlanden Schadeverzekering Maatschappij N.V. \n",
      "\n",
      "DELA Natura- en levensverzekeringen N.V. \n",
      "\n",
      "Onderlinge Waarborgmaatschappij voor Instellingen in de Gezondheidszorg MediRisk B.A. \n",
      "\n",
      "Reis- en Rechtshulp N.V. \n",
      "\n",
      "Onderlinge Verzekering Maatschappij Twente U.A. \n",
      "\n",
      "AEGON Spaarkas N.V. \n",
      "\n",
      "ASR Aanvullende Ziektekostenverzekeringen N.V. \n",
      "\n",
      "Lifetri Uitvaartverzekeringen N.V. \n",
      "\n",
      "Lemonade Insurance N.V. \n",
      "\n",
      "Onderlinge Verzekeringmaatschappij \"SOM\" U.A. \n",
      "\n",
      "Samenwerking Glasverzekering N.V. \n",
      "\n",
      "Klaverblad Schadeverzekeringsmaatschappij N.V. \n",
      "\n",
      "N.V. Univé Her \n",
      "\n",
      "Mutual Insurance Association \"Munis\" (Onderlinge Verzekeringsmaatschappij \"Munis\") U.A. \n",
      "\n",
      "IZA Zorgverzekeraar N.V. \n",
      "\n",
      "DAS Nederlandse Rechtsbijstand Verzekeringmaatschappij N.V. \n",
      "\n",
      "Univé Stad en Land Brandverzekeraar N.V. \n",
      "\n",
      "ONVZ Ziektekostenverzekeraar N.V. \n",
      "\n",
      "DLE Natura Uitvaartverzekeringen N.V. \n",
      "\n",
      "Proteq Levensverzekeringen N.V. \n",
      "\n",
      "VGZ Zorgverzekeraar N.V. \n",
      "\n",
      "Univé Noord-Nederland Verzekeraar N.V. \n",
      "\n",
      "Blue Square Re N.V. \n",
      "\n",
      "SCILDON N.V. \n",
      "\n",
      "Achmea Zorgverzekeringen N.V. \n",
      "\n",
      "Onderlinge Levensverzekering-Maatschappij \"'s-Gravenhage\" U.A. \n",
      "\n",
      "Achmea Reinsurance Company N.V. \n",
      "\n",
      "Onderlinge Waarborgmaatschappij Sazas U.A. \n",
      "\n",
      "Onderlinge Waarborgmaatschappij Centrale Zorgverzekeraars groep, Zorgverzekeraar U.A. \n",
      "\n",
      "AnderZorg N.V. \n",
      "\n",
      "Goudse Schadeverzekeringen N.V. \n",
      "\n",
      "Ansvar Verzekeringsmaatschappij N.V. \n",
      "\n",
      "BNP PARIBAS CARDIF LEVENSVERZEKERINGEN N.V. \n",
      "\n",
      "Onderling Verzekerd U.A. \n",
      "\n",
      "ABN AMRO Levensverzekering N.V. \n",
      "\n",
      "Lifetri Verzekeringen N.V. \n",
      "\n",
      "ASR Levensverzekering N.V. \n",
      "\n",
      "De Friesland Zorgverzekeraar N.V. \n",
      "\n",
      "Achmea Schadeverzekeringen N.V. \n",
      "\n",
      "Uitvaartverzekering Twenthe N.V. \n",
      "\n",
      "VvAA schadeverzekeringen N.V. \n",
      "\n",
      "Univé Dichtbij Brandverzekeraar N.V. \n",
      "\n",
      "Stad Holland Zorgverzekeraar Onderlinge Waarborgmaatschappij U.A. \n",
      "\n",
      "Onderlinge Brandwaarborg Maatschappij Noord Holland U.A. \n",
      "\n",
      "AKZO Nobel Assurantie N.V. \n",
      "\n",
      "Anker Insurance Company N.V. \n",
      "\n",
      "Klaverblad Levensverzekering N.V. \n",
      "\n",
      "Onderlinge Waarborgmaatschappij Zorgverzekeraar Zorg en Zekerheid U.A. \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Where is <A> located and what is the registration number?\n",
    "\n",
    "query = \"\"\" select distinct ?a ?b where{ ?e eiopa-Base:hasIdentifyingName \"achmea zorgverzekeringen n.v.\" . ?e gleif-Base:identifies ?x .?e eiopa-Base:hasInsuranceUndertakingID ?b. ?x gleif-L1:hasLegalAddress/gleif-base:hasCity ?a.}\n",
    "        \"\"\"\n",
    "results = g.query(query)\n",
    "\n",
    "for row in results:\n",
    "    for item in row:\n",
    "        print(get_name(item), end = \" \")\n",
    "    print(\"\\n\")\n",
    "    \n",
    "generator_query = \"\"\"\n",
    "                    select distinct ?a where{ ?x gleif-L1:hasLegalName ?a.?e gleif-Base:identifies ?x .?e eiopa-Base:hasInsuranceUndertakingID []. ?x gleif-L1:hasLegalAddress/gleif-base:hasCity [].?e eiopa-Base:hasEUCountryWhereEntityOperates CountryCodes:NL.}\n",
    "                  \"\"\"\n",
    "\n",
    "results = g.query(generator_query)\n",
    "for row in results:\n",
    "    for item in row:\n",
    "        print(get_name(item), end = \" \")\n",
    "    print(\"\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "pycharm": {
     "name": "#%%\n"
    }
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [conda env:nqm_fairseq] *",
   "language": "python",
   "name": "conda-env-nqm_fairseq-py"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
