#version: 0.2
a r
v ar
var _
s e
e r
k _
h a
d o
e i
se p
sep _
sep_ do
sep_do t</w>
r a
o p
b ra
ha s
: has
o t
q u
qu ot
quot _
quot_ m
quot_m ar
quot_mar k_
c k_
bra ck_
a se
C T</w>
B ase
- Base
t i
i n
g l
gl ei
glei f
e n</w>
var_ s</w>
var_ e</w>
a t
o s
var_ a</w>
e n
e s</w>
in g
e k
n .
op a
opa -Base
opa-Base :has
